
HelpListUtilNow = [[
⚠️راهنمای استفاده از ربات ᴴᵃᵈᵃᴺᵉᵗ

̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶̶̶ـ̶̶ـ̶̶ـ̶̶

1️⃣- راهنمای قفل ها
🔚مربوط به قفل های بات ، دریافت تنظیمات و ...

2️⃣- راهنمای فیلتر
🔚مربوط به فیلتر کلمات ، دریافت لیست فیلتر و ...

3️⃣- راهنمای مدیریتی
🔚مربوط به دریافت اطلاعات کاملی از خود ، گروه و ...

4️⃣- راهنمای پاکسازی
🔚مربوط به پاکسازی موارد گروه 

̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶ـ̶̶̶̶ـ̶̶ـ̶̶ـ̶̶ـ
⬅️ برای دریافت هر آموزش عبارت آن را تایپ کنید .

✏️ برای مثال :
راهنمای قفل ها
➖➖➖➖➖➖➖➖➖➖➖
      ➡️Hidden Eye⬅️
     [ @HadaNet ]
]]
---------------------------------------

-- راهنمای قفل ها
LocksHelp = [[
📝 راهنمای قفل های بات :

━━━ 🔐 قفل های اصلی ⏬ ━━━

 قفل   ◀️ [لینک] - [تگ] - [فروارد] - [کیبورد] - [دستورات] - [انگلیسی] - [فارسی] - [اسپم] - [ربات] - [خدمات]


 بازکردن  ◀️ [لینک] - [تگ] - [فروارد] - [کیبورد] - [دستورات] - [انگلیسی] - [فارسی] - [اسپم]  - [ربات] - [خدمات]

برای مثال :
✅ قفل لینک   
✅ بازکردن لینک      ❌باز کردن لینک

➖➖➖➖➖➖➖➖➖➖➖
☠️ اخراج کاربری که در گروه پیام رگباری ارسال کند :

✔️ قفل رگباری
✖️ بازکردن رگباری

🔧تنظیم حساسیت پیام های رگباری (مکرر) :

🔸 تنظیم اسپم 7
» به جای 7 میتوانید اعداد 5 تا 20 را قرار دهید.

➖➖➖➖➖➖➖➖➖➖➖

━━━ 🗂 قفل های رسانه ای ⏬ ━━━

 قفل  ◀️ [صدا] - [عکس] - [ویدیو] - [فایل] - [متن] - [گیف] - [استیکر] - [مخاطب]

بازکردن  ◀️ [صدا] - [عکس] - [ویدیو] - [فایل] - [متن] - [گیف] - [استیکر] - [مخاطب]

برای مثال :
✅ قفل استیکر   
✅ بازکردن استیکر      ❌باز کردن استیکر

━━━━ 💢 قفل های مهم ━━━━

♨️ اخراج کاربری که در گروه لینکی ارسال کند :

✔️ قفل سخت
✖️ بازکردن سخت
➖➖➖➖➖➖➖➖➖➖
🚫 حذف تمامی پیام های ارسالی در گروه (بستن چت) :

✔️ قفل چت
✖️ بازکردن چت
➖➖➖➖➖➖➖➖➖➖
🛠 نمایش تنظیمات گروه :

⚜️ تنظیمات
➖➖➖➖➖➖➖➖➖➖➖
      ➡️Hidden Eye⬅️
      [ @HadaNet ]
]]
--راهنمای فیلتر
FilterHelp = [[
✅ آموزش فیلتر کلمات :
ا➖➖➖➖

💡بار فیلتر کردن یک کلمه ، بات در صورت مشاهده ی اون کلمه در یک متن ، اون متن رو حذف خواهد کرد.

ا➖➖➖➖
👈 دستورات قسمت فیلتر :

➕ فیلتر کردن یک کلمه :
فیلتر کلمه

➖ رفع فیلتر یک کلمه :
رفع فیلتر کلمه

📝 دریافت لیست کلمات فیلتر شده :
لیست فیلتر

❌ حذف کل کلمات فیلتر شده :
پاکسازی لیست فیلتر
ا➖➖➖➖

➕ مثال فیلتر کردن یک کلمه :
فیلتر احمق

» در اینجا عبارت "احمق" فیلتر خواهد شد.

➖ مثال رفع فیلتر یک کلمه :
رفع فیلتر احمق

» در این قسمت عبارت "احمق" رفع فیلتر خواهد شد.
➖➖➖➖➖➖➖➖➖➖➖
      ➡️Hidden Eye⬅️
       [ @HadaNet ]
]]

--راهنمای اطلاعات
ManagerHelp = [[
✅ راهنمای دریافت مدیریتی :
ا➖➖➖➖
✔️دستور سایلنت کردن فرد مورد نظر در گروه : 
🔸 ساکت کردن (ریپلی،یورزنیم) 

✔️دستور اخراج کردن فرد مورد نظر از گروه :
🔸اخراج (ریپلی،یورزنیم)

✔️دستور مسدود کردن فرد مورد نظر از گروه : 
🔸مسدود (ریپلی،یورزنیم)

✔️دستور خارج کردن ربات از گروه : 
 🔸خروج

✔️دستور گرفتن آیدی عددی خود در گروه :
🔸ایدی یا id


✔️ دستور دریافت اطلاعات کلی گروه :
🔸اطلاعات گروه

✔️ دستور دریافت لیست ادمین های گروه :
🔸ادمین ها

✔️ دستور دریافت لیست مدیران فرعی بات در گروه :
🔸مدیران فرعی

✔️ دستور دریافت لیست بات های API موجود در گروه :
🔸ربات ها

✔️ دستور دریافت آیدی مدیر اصلی بات در گروه :
🔸مدیر اصلی

ا➖➖➖➖
📎 کار با لینک در گروه :

⭕️دستور تنظیم لینک در گروه :
🔹تنظیم لینک

⭕️دستور دریافت لینک گروه :
🔹لینک

ا➖➖➖➖
❇️انتخاب فرد مورد نظر برای مقام

👮🏻برای مقام دادن به مدیر فرعی گروه :
▫️ترفیع (ریپلی،یورزنیم)

👮🏻برای عزل مدیر فرعی گروه :
▪️عزل (ریپلی،یورزنیم)

❇️برای تنظیم فرد مورد نظر برای صاحب گروه 

👤برای تنظیم کردن فرد به عنوان صاحب گروه:
▫️مالک گروه (ریپلی،یورزنیم)

ا➖➖➖➖
〽️برای گرفتن مقام خود در گروه:
*️⃣ مقام

➖➖➖➖➖➖➖➖➖➖➖
      ➡️Hidden Eye⬅️
       [ @HadaNet ]
]]
--راهنمای پاکسازی
CleanHelp = [[
✅ راهنمای پاکسازی گروه :
ا➖➖➖➖

👈 دستورات پاکسازی :

⭕️ برای حذف کردن ربات ها از گروه  :
      پاکسازی ربات ها

⭕️برای حذف کردن دلیت اکانت شده های گروه :
     پاکسازی حذف شده ها

❗️(مدیر اصلی گروه ) 👈🏻برای حدف لیست مدیران فرعی گروه :
     پاکسازی لیست مدیران فرعی

❗️(مدیر اصلی گروه )👈🏻برای حذف لیست مسدود شده های گروه :
    پاکسازی لیست مسدود

❗️(مدیران گروه )👈🏻برای حذف لیست سکوت شده های گروه :
    پاکسازی لیست سکوت

❗️(مدیران گروه )👈🏻برای حذف لیست کلمات فیلتر شده گروه :
    پاکسازی لیست فیلتر

❕برای حذف پیام مورد نظر خود از :
    حذف (ریپلی)

❗️(سودو )👈🏻برای حذف مدیر اصلی گروه  :
   پاکسازی مدیر اصلی

➖➖➖➖➖➖➖➖➖➖➖
      ➡️Hidden Eye⬅️
        [ @HadaNet ]

]]

local function run(msg,matches)

	------- LOCK CMD
	data = load_data(_config.moderation.data)
	if data[tostring(msg.to.id)] then
		if data[tostring(msg.to.id)]['settings'] then
			if data[tostring(msg.to.id)]['settings']['lock_cmd'] then
				lock_cmd = data[tostring(msg.to.id)]['settings']['lock_cmd']
				if lock_cmd == "yes" and not is_momod(msg) then
					return
				end
			end
		end
	end
	-------
	
	if matches[1] == "راهنما" then
		return reply_msg(msg.id,HelpListUtilNow,ok_cb,false)
	end
	
	if matches[1] == "help" then
		return reply_msg(msg.id,HelpListUtilNow,ok_cb,false)
	end
	
	if matches[1] == "راهنمای" and matches[2] then
		
		if matches[2] == "قفل ها" then
			return reply_msg(msg.id,LocksHelp,ok_cb,false)
		end
		
		if matches[2] == "فیلتر" then
			return reply_msg(msg.id,FilterHelp,ok_cb,false)
		end
		
		if matches[2] == "مدیریتی" then
			return reply_msg(msg.id,ManagerHelp,ok_cb,false)
		end
		
		if matches[2] == "پاکسازی" then
			return reply_msg(msg.id,CleanHelp,ok_cb,false)
		end
		
	end -- end matches[1] == "راهنمای"

end	

return {
patterns = {
	"^(راهنما)$",
	"^([Hh][Ee][Ll][Pp])$",
	"^(راهنمای) (.*)"
},
	run = run
}

